function Cookies(params) {
  return (
    <div className="Cookies">
      <h1>Cookies</h1>
      <p>
        我使用Cookies来保持我的网站和我开发的软件的可靠性，安全性和个性化。当您接受Cookies时，这有助于通过我识别您的身份、记住您的偏好、或提供个性化用户体验来帮助我改善网站。
        <br />
        <br />
        本政策应与我的
        <a href="/privacy" className="link">
          隐私政策
        </a>
        一起阅读，该隐私政策解释了我如何使用个人信息。
        <br />
        <br />
        如果您对我使用您的个人信息或Cookies的方式有任何疑问，请通过
        <span className="note">swechy@qq.com</span>与我联系。
        <br />
        <br />
        如果您想管理您的Cookies，请按照下面“如何管理Cookies”部分中的说明进行操作。
      </p>
      <h1>什么是Cookies</h1>
      <p>
        Cookies是您访问网站时放置在您的计算机或移动设备上的小型数据文件。在您访问网站时，网络服务器就会将该文件发送至您的浏览器。
        <br />
        <br />
        Cookies是一种文本格式的信息串，会通过本网站下载至浏览时所用的计算机硬盘上数码存根文件夹中，并在您访问网站时发送您信息使得网站能够识别您。您使用Cookies功能，有助我网站在您访问时提供更准确的信息和便利服务。
        <br />
        <br />
        Cookies通常被分类为“会话”Cookies或“持久”Cookies。会话Cookies可以帮助您有效地浏览网站，跟踪您的页面到页面的进度，以便不要求您在当前访问期间重复提供的信息，
        <br />
        <br />
        比如您在切换页面时不会清空您的语言偏好。
        <br />
        <br />
        会话Cookies存储在临时内存中，并在Web浏览器关闭时被删除。
        <br />
        <br />
        持久性Cookies可以存储用户偏好，它们存储在您的设备上，
        <br />
        <br />
        重新启动浏览器时仍然有效。例如，我使用持久性Cookies来记录您选择的明暗主题、字体大小或其他设置。这可以使您在下次访问我的网站时，不用重新配置。
      </p>
      <h1>如何管理Cookies</h1>
      <p>
        我不会将Cookies用于本文件所述目的之外的任何用途。您有权决定接受或拒绝Cookies，您可以设置或修改您的网页浏览器控件，以接受或拒绝Cookies。
        <br />
        <br />
        如果您选择拒绝Cookies，您仍然可以使用我的网站，尽管此时您在访问我网站的一些功能和区域时可能会受限。
        <br />
        <br />
        很多网络浏览器均设有请勿追踪功能，该功能可向网站发布请勿追踪请求。
        <br />
        <br />
        目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果用户的浏览器启用了请勿追踪功能，那么我的网站也会尊重用户的选择。
      </p>
      <h1>更多信息</h1>
      <p>
        有关我数据处理的更多信息，请参阅我的
        <a href="/privacy" className="link">
          隐私政策
        </a>
        。如果您对此Cookie政策有任何疑问，请通过
        <span className="note">swechy@qq.com</span>与我联系。
      </p>
      <h1>对此Cookie政策的更改</h1>
      <p>
        我可能对此Cookie政策所做的任何更改都将发布在此页面上。如果更改很重要，我会在我的主页或应用上明确指出该政策已更新。
      </p>
    </div>
  );
}
export default Cookies;
